src/main/resources/rulebase-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:lr="http://techprimers.com/spring-boot-soap-example">
    <soapenv:Header/>
    <soapenv:Body>
        <lr:loanRequest>
            <lr:creditscore>123</lr:creditscore>
            <lr:loanamount>100.01</lr:loanamount>
        </lr:loanRequest>
    </soapenv:Body>
</soapenv:Envelope>